def solution(letter):
    answer = ''
    # letter을 공백기준으로 split하기
    # 나눈 값을 morse에서 순회하며 찾기
    # 찾은 값을 anwer에 넣기
    morse = { 
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    }
    
    let = letter.split()
    
    for i in let:
        answer += morse[i]
    
    return answer